Documents/ДоговорРеструктуризацииДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ДоговорРеструктуризацииДолга</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлатежиПоРеструктуризацииДолга</xr:Item>
				<xr:Item>InformationRegister.НазначенныеУслуги</xr:Item>
				<xr:Item>InformationRegister.СостояниеРеструктуризацииДолга</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРассрочки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияРассрочки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийДоговораРеструктуризацииДолга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураДолга</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДатыЗапретаИзменения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ДатыЗапретаИзменения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеДатыЗапрета</Name>
					<Comment>Описание относительной даты запрета, используемое для вычисления даты запрета на текущую дату</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий к отдельной настройке запрета по пользователю/группу пользователей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыВнешнихПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыНазначенияДатЗапрета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийДоговораРеструктуризацииДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийДоговораРеструктуризацииДолга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаключениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасторжениеДоговора</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДоговорРеструктуризацииДолга/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	ПолучитьЛСНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЛСНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
	               |	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(, ) КАК РасчетыПоЛицевымСчетамОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	               |		ПО РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
	               |ГДЕ
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет = &ЛицевойСчет";
				   
	Запрос.УстановитьПараметр("Дата",Объект.Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	
	Объект.ОтветственныйВладелец = Результат.ОтветственныйВладелец;
	Если Объект.ВидОперации = Перечисления.ВидыОперацийДоговораРеструктуризацииДолга.ЗаключениеДоговора Тогда
		Объект.СуммаДолга  = Результат.СуммаОстаток;
	Иначе
		Объект.СуммаДолга  = ПолучитьСуммуРеструктуризации(Объект.Дата,Объект.ЛицевойСчет);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачалаРассрочки)  Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не установлена дата начала реструктуризации. Автоматическое распределение невозможно!'; uk = 'Не встановлена дата початку реструктуризації. Автоматичний розподіл неможливий!'");
		Сообщение.Поле = "Объект.ДатаНачалаРассрочки";
		Сообщение.Сообщить();
		Возврат;
	ИначеЕсли  НЕ ЗначениеЗаполнено(Объект.ДатаЗавершенияРассрочки)	Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не установлена дата окончания реструктуризации. Автоматическое распределение невозможно!'; uk = 'Не встановлена дата зкінчення реструктуризації. Автоматичний розподіл неможливий!'");
		Сообщение.Поле = "Объект.ДатаЗавершенияРассрочки";
		Сообщение.Сообщить(); 
		Возврат;
		
	ИначеЕсли Объект.ДатаЗавершенияРассрочки < Объект.ДатаНачалаРассрочки Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Дата окончания реструктуризации меньше даты начала! '; uk = 'Дата закінчення реструктуризації менше дати початку!'");
		Сообщение.Сообщить(); 
		Возврат;
		
	КонецЕсли;	
			
	ЗначениеКорректировкиОкругления = 0.01;
	ИтогБазыРаспределения = Объект.СтруктураДолга.Итог("Коэффициент");
	
	ОшибкаОкругления = 0;
	Для Каждого СтрокаСтруктуры Из Объект.СтруктураДолга Цикл
		
		СуммаПлатежа = Объект.СуммаДолга * (СтрокаСтруктуры.Коэффициент / ИтогБазыРаспределения);
		СтрокаСтруктуры.СуммаПлатежа = СуммаПлатежа;
		
		ОшибкаОкругления = ОшибкаОкругления + (СуммаПлатежа - СтрокаСтруктуры.СуммаПлатежа);
		Если ОшибкаОкругления >= ЗначениеКорректировкиОкругления Тогда
			СтрокаСтруктуры.СуммаПлатежа = СтрокаСтруктуры.СуммаПлатежа + ЗначениеКорректировкиОкругления;
			ОшибкаОкругления = ОшибкаОкругления - ЗначениеКорректировкиОкругления;
		ИначеЕсли ОшибкаОкругления <= -ЗначениеКорректировкиОкругления Тогда
			СтрокаСтруктуры.СуммаПлатежа = СтрокаСтруктуры.СуммаПлатежа - ЗначениеКорректировкиОкругления;
			ОшибкаОкругления = ОшибкаОкругления + ЗначениеКорректировкиОкругления;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаСтруктуры Из Объект.СтруктураДолга Цикл
		
		Если СтрокаСтруктуры.СуммаПлатежа > 0 Тогда
			СтрокаСтруктуры.СуммаПлатежа = СтрокаСтруктуры.СуммаПлатежа + (Объект.СуммаДолга - Объект.СтруктураДолга.Итог("СуммаПлатежа"));
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ТекстВопроса = НСтр("ru = 'Таблица будет очищена. Продолжить?'; uk = 'Таблиця буде очищена. Продовжити?'");
	Ответ = Вопрос(ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		Объект.СтруктураДолга.Очистить();
		
		ДатаНачисления = НачалоМесяца(Объект.ДатаНачалаРассрочки);
		
		Пока ДатаНачисления <= НачалоМесяца(Объект.ДатаЗавершенияРассрочки) Цикл
			ДобСтрока  = Объект.СтруктураДолга.Добавить();
			ДобСтрока.МесяцНачисления  = НачалоМесяца(ДатаНачисления);
			ДобСтрока.Коэффициент = 1;
			ДатаНачисления = ДобавитьМесяц(ДатаНачисления,1);
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ДатуЗапретаИзмененияДанных(Здание)

	  Запрос = Новый Запрос;
	  ЗАпрос.Текст = "ВЫБРАТЬ
	                 |	ДатыЗапретаИзменения.ДатаЗапрета,
	                 |	ДатыЗапретаИзменения.Объект
	                 |ИЗ
	                 |	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	                 |ГДЕ
	                 |	ДатыЗапретаИзменения.Объект = &Объект";
		Запрос.УстановитьПараметр("Объект",Здание);
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Возврат Выборка.ДатаЗапрета;
		Иначе
			Возврат Неопределено;
		КонецЕсли;	
			

КонецФункции // ДатаЗапретаИзмененияДанных()


&НаСервереБезКонтекста
Функция ПолучитьСуммуРеструктуризации(ДатаРазрыва,ЛицевойСчет)

	 ЗАпрос = Новый Запрос;
	 Запрос.Текст =  "ВЫБРАТЬ
	                 |	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	                 |ИЗ
	                 |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	                 |			&Период,
	                 |			Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
	                 |				И ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОстатки";
	Запрос.УстановитьПараметр("Период",ДатаРазрыва);
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
	
	Результат = Запрос.Выполнить();
	
	Если  НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.СуммаОстаток;
	Иначе
		Возврат 0;
	КонецЕсли;	 
		 

КонецФункции // ПолучитьСуммуРеструктуризации()


&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();
		
КонецПроцедуры

// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()

	Если Объект.ВидОперации = Перечисления.ВидыОперацийДоговораРеструктуризацииДолга.РасторжениеДоговора Тогда
		Элементы.Группа3.Видимость = Ложь;
		Элементы.Группа5.Видимость = Ложь;
		Элементы.Комментарий.Видимость = Истина;
	Иначе
		Элементы.Группа3.Видимость = Истина;
		Элементы.Группа5.Видимость = Истина;
		Элементы.Комментарий.Видимость = Ложь;

	КонецЕсли;	

КонецПроцедуры // УстановитьВидимостьИДоступность()



&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		Объект.СуммаДолга = ПолучитьСуммуРеструктуризации(Объект.Дата,Объект.ЛицевойСчет);
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если  НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		Объект.ВидОперации = Перечисления.ВидыОперацийДоговораРеструктуризацииДолга.ЗаключениеДоговора;
	КонецЕсли;
	
	УстановитьВидимостьИДоступность();
КонецПроцедуры
